In [1]:
# import pandas as pd
# import numpy as np
# import seaborn as sns
# import statistics as stats
# import matplotlib.pyplot as plt

In [2]:
'''
x = input("Please input a number")

try:
    x = int(x)*2  #if doesn't work
except:
    print("Not a number")
    
print(x)

'''

'\nx = input("Please input a number")\n\ntry:\n    x = int(x)*2  #if doesn\'t work\nexcept:\n    print("Not a number")\n    \nprint(x)\n\n'

In [3]:
'''
x = input("Please type a number: ")

try:
    x = int(x)
except ValueError:
    
    try:
        x = float(x)
    except ValueError:
        print("Not a number")
        #exit()

x = x * 2
print(x)
'''

'\nx = input("Please type a number: ")\n\ntry:\n    x = int(x)\nexcept ValueError:\n    \n    try:\n        x = float(x)\n    except ValueError:\n        print("Not a number")\n        #exit()\n\nx = x * 2\nprint(x)\n'

In [4]:
import pandas as pd
import numpy as np

df = pd.read_csv("/Users/eupirate/Documents/DA_L7/wk10_py_employees.csv")

In [5]:
df.head()

  First Name  Gender  Salary Bonus % Senior Management             Team
0    Douglas    Male   97308   6.945              TRUE        Marketing
1     Thomas    Male   61933     NaN              TRUE              NaN
2      Maria  Female  130590  11.858             FALSE          Finance
3      Jerry    Male     NaN    9.34              TRUE          Finance
4      Larry    Male  101004   1.389              TRUE  Client Services

In [8]:
df.info

<bound method DataFrame.info of     First Name  Gender  Salary Bonus % Senior Management                  Team
0      Douglas    Male   97308   6.945              TRUE             Marketing
1       Thomas    Male   61933     NaN              TRUE                   NaN
2        Maria  Female  130590  11.858             FALSE               Finance
3        Jerry    Male     NaN    9.34              TRUE               Finance
4        Larry    Male  101004   1.389              TRUE       Client Services
..         ...     ...     ...     ...               ...                   ...
995      Henry     NaN  132483  16.655             FALSE          Distribution
996    Phillip    Male   42392  19.675             FALSE               Finance
997    Russell    Male   96914   1.421             FALSE               Product
998      Larry    Male   60500  11.985             FALSE  Business Development
999     Albert    Male  129949  10.169              TRUE                 Sales

[1000 rows x 6 columns]>

In [10]:
df["Team"].unique()

array(['Marketing', nan, 'Finance', 'Client Services', 'Legal', 'Product',
       'Engineering', 'Business Development', 'Human Resources', 'Sales',
       'na', 'Distribution', 'n.a.', '?'], dtype=object)

In [11]:
# deal with dirty data
# 1. typicially using MEAN value - but in DA is a major NO NO NO!!!! you're shifting data
# 2.
# 3.